Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    Partial shading: use cases of this project don't assume optimal work with significant partial shading (no "full scan" is implemented, nor it's possible with such scheme).
    Personal notes:
        *- although I believe it will work pretty well with real-world partial shading cases;
        *- partial shading isn't a problem that needs solving (except for very specific forced cases) as solar panels as technology simply doesn't assume partial shading - so just do proper installation / consider proper sizes to avoid any partial shading;
*/

#define _XTAL_FREQ 4000000

#include <xc.h>

//BEGIN CONFIG
#pragma config FOSC = INTRCIO
#pragma config WDTE = OFF // Watchdog Timer Enable bit (WDT enabled)
#pragma config PWRTE = OFF // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = OFF // MCLR internal, use pin as IO
#pragma config BOREN = ON // Brown-out Reset Enable bit (BOR enabled)
#pragma config CP = OFF // Flash Program Memory Code Protection bit (Code protection off)
#pragma config CPD = OFF // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
//END CONFIG


/*
    PROJ_CONST_THR notes:
    - for now using a constant hard-hardcoded threshold value (with hardcoded ifdef-generated multiplication function);
    - planning to compile several versions with different offsets for the value to compensate input diode Vf;

    Input diode Vf (voltage drop on the input shottky diode):
    - due to scheme specifics measurings of voltage is done after diode(s)*
        *could be done before diode if only one solar panel is used (one parallel connection);
        *if several panels are connected in parallel - each 'positive' wire should be connected through an individual diode (or each negative, but not mixed);
    - when measuring raw (no load/OCV) voltage - the diode current is minimum, diode Vf is minimum and can be negligible;
    - when measuring voltage during load - Vf is larger and depends on current, specific diode, diode temperature,
        so to expect a correct(more or less) percentage of raw(no load/OCV) voltage on the panel(s) - some offset of diode Vf should be considered,
        so: several versions of FW with different hardcoded THR would be available to accomodate target case the best way;
    - current dependency: for big current Vf would be bigger and appropriate offset (for maximum expected current) should be used to maximize output power (+minimize current fluctuations);
    - other offset considerations: it's better to offset THR a little lower (linear loss comparing to MPP) than higher (rather exponencial loss according to solar panels U/I characteristics);
*/
#define PROJ_CONST_THR 198 // hard constant threshold percentage (x/255) of raw(no load/OCV) voltage to hold

// version info (3 numbers and letter) is accessible at top program-memory addresses right before OSCCAL (retlw commands)
#define FW_VER_MAJOR 0
#define FW_VER_MINOR 7
#define FW_VER_THR PROJ_CONST_THR
#define FW_VER_OPTION 'F' // some letter describing topology/configuration of compiled code. default is 'F'
/*
    FW_VER_OPTION vaiants:
    - 'A' (0x41) : unregulated output;
        GPIO0 - PWM (output-fet-driving pin);
        GPIO1 - controls mosfet of buffer capacior;
        GPIO2 is ADC input;
        // next are debug pins which were recommended to stay disconnected:
        GPIO4 - input mode debug pin, GPIO5 - output mode debug pin.
        GPIO3 - unused floating input;
    - 'B' (0x42) : optionally regulated output; 'B' is extension of 'A' in case debug pins weren't used.
        GPIO0 - PWM (output-fet-driving pin);
        GPIO1 - controls mosfet of buffer capacior;
        GPIO2 is ADC input;
        GPIO4 - inverted 'limit' input, has internal pullup. pull to gnd when outputting power needs to be suspended;
        GPIO5 - inverted PWM pin (strict phase matching with non-inverted PWM). can be used to strengthen closing output fet with small extra fet.
        GPIO3 - unused floating input;
*/





#define AUX_STRINGIFY_INTERNAL(foo) #foo
#define AUX_STRINGIFY(foo) AUX_STRINGIFY_INTERNAL(foo)

// manual params
#define PROJ_TMR_PRESCALE (0b111) // x256

// pins / topology
#if FW_VER_OPTION == 'B'
#define PROJ_BIT_NUM_OUT_PWM_0 0 // GPIO0 : N-channel mosfet (or 'enable' pin on output line) controlling output line, PULLDOWN external resistor
#define PROJ_BIT_NUM_OUT_PWM_1 PROJ_BIT_NUM_OUT_PWM_0
#define PROJ_BIT_NUM_OUT_CAP 1 // GPIO1 : N-channel mosfet controlling power capacitor, PULLUP external resistor 200k
#define PROJ_BIT_NUM_IN_INV_LIMIT 4 // GPIO4 - inverted 'limit' input
#define PROJ_BIT_NUM_OUT_INV_PWM 5 // GPIO5 - inverted PWM pin, strict phase match
#define PROJ_ADC_CH_VOL 2 // ADC channel - AN2 (GPIO2) : voltage divider for power line - calculate so that it maxes out to chip PSU level (used 3.3 regulator)
#elif FW_VER_OPTION == 'F'
#define PROJ_BIT_NUM_OUT_PWM_0 1 // GPIO1 : N-channel mosfet (or 'enable' pin on output line) controlling output line, PULLDOWN external resistor
#define PROJ_BIT_NUM_OUT_PWM_1 2 // GPIO2 : N-channel mosfet (or 'enable' pin on output line) controlling output line, PULLDOWN external resistor
#define PROJ_BIT_NUM_OUT_CAP 0 // GPIO0 : N-channel mosfet controlling power capacitor, PULLUP external resistor 200k
#define PROJ_BIT_NUM_IN_INV_LIMIT 5 // GPIO5 - inverted 'limit' input
#define PROJ_ADC_CH_VOL 3 // ADC channel - AN3 (GPIO4) : voltage divider for power line - calculate so that it maxes out to chip PSU level (used 3.3 regulator)
#else
// TODO different configurations
#endif

#define PROJ_ADC_ADCS 0b010 // conversion time; 32 Tosc (8 tacts)

#define PROJ_THR_DIFF_INSTANT_DROPOUT 6 // thr_hi - adcval >= 'this' ? full power drop
#define PROJ_PWR_LEVEL_MAX 27
#define PROJ_PWR_LEVEL_CUT 19 // TODO will be reworked to different approach

#define PROJ_PWR_RISE_DELAY 3 // number of consequent times for ADC checks to trigger single rise in certain cases

GPIObits_t gp_shadow;

uint8_t app_rise_counter;

#define PROJ_OUT_FET_PINS_POS_MASK ((1 << PROJ_BIT_NUM_OUT_PWM_0) | (1 << PROJ_BIT_NUM_OUT_PWM_1))
#ifdef PROJ_BIT_NUM_OUT_INV_PWM
    #define PROJ_OUT_FET_PINS_INV_MASK (1 << PROJ_BIT_NUM_OUT_INV_PWM)
#else
    #define PROJ_OUT_FET_PINS_INV_MASK 0
#endif
#define PROJ_OUT_FET_PINS_ALL_MASK (PROJ_OUT_FET_PINS_POS_MASK | PROJ_OUT_FET_PINS_INV_MASK)

