Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
#define PROJ_STATE_GPIO_CAPON_PWMON ((1 << PROJ_BIT_NUM_OUT_CAP) | PROJ_OUT_FET_PINS_POS_MASK)
#define PROJ_STATE_GPIO_CAPON_PWMOFF ((1 << PROJ_BIT_NUM_OUT_CAP) | PROJ_OUT_FET_PINS_INV_MASK)
#define PROJ_STATE_GPIO_CAPOFF_PWMOFF (PROJ_OUT_FET_PINS_INV_MASK)


uint8_t dirty_flags;
#define APP_DIRTY_FLAG_TRAW 0 // bit numbers. if another 1000ms have passed and requires processing
#define APP_DIRTY_FLAG_TDEBUG 1 // debug time (not used if not debug build)
#define APP_DIRTY_FLAG_THRS 2 // if thresholds need recalculation
#define APP_DIRTY_FLAG_NOP1 3
#define APP_DIRTY_FLAG_NOP2 4

/*
    OSSCAL deviation: on my PIC it was x1.65 difference between min and max frequency (osccal 0x00-min freq and 0xFC-max freq)
    with typical calibrated values checked on 5 pics being around 0x24 - 0x44, so setting osccal to max value is assumed
    to multiply actual frequency by around x1.5 (comparing to 4mhz spec).
*/

// relies on active bank 0
#define PROJ_SET_GPIO(a_value) \
    asm("movlw " AUX_STRINGIFY(a_value)); \
    asm("movwf 5"); /* assign GPIO */ \
    asm("movwf _gp_shadow"); /* refresh gp_shadow */
#define PROJ_SET_GPIO_CAPON_PWMON PROJ_SET_GPIO(PROJ_STATE_GPIO_CAPON_PWMON)
#define PROJ_SET_GPIO_CAPON_PWMOFF PROJ_SET_GPIO(PROJ_STATE_GPIO_CAPON_PWMOFF)
#define PROJ_SET_GPIO_CAPOFF_PWMOFF PROJ_SET_GPIO(PROJ_STATE_GPIO_CAPOFF_PWMOFF)

// local isr vars
#define PROJ_ISR_CTR_INITER_T0 16
uint8_t isr_ctr_t0 = PROJ_ISR_CTR_INITER_T0;

// isr cache
uint8_t temp_w;
uint8_t temp_status;
//

asm("global _isr");
void isr(void) __at(0x0004)
{
    asm("movwf _temp_w");
    asm("swapf 3,w");
    asm("movwf _temp_status");
    //asm("bcf 3,5"); // select bank 0 - may be not necessary in isr
    // context saved

    PROJ_SET_GPIO_CAPON_PWMOFF
    // ++64ms
    asm("decfsz _isr_ctr_t0,f"); // --ctr, test
    asm("goto labe_isr_out");
        asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_TRAW));
        asm("movlw " AUX_STRINGIFY(PROJ_ISR_CTR_INITER_T0));
        asm("movwf _isr_ctr_t0"); // reinit ctr
    asm("labe_isr_out:");
    asm("bcf 11,2"); // INTCONbits.T0IF = 0; // regardless of current bank

    // context restoring
    asm("swapf _temp_status,w");
    asm("movwf 3"); // recover status
    asm("swapf _temp_w,f");
    asm("swapf _temp_w,w"); // recover w
    //
    asm("retfie"); // compiler auto-generates "return" here, nevermind at the moment, just use explicit retfie.
}

// >= 3 tacts: 3 or 5
#define PROJ_INLINED_ISR_REPLACEMENT(lbl_name) \
    asm("decfsz _isr_ctr_t0,f"); \
    asm("goto "lbl_name); \
        asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_TRAW)); \
        asm("movlw " AUX_STRINGIFY(PROJ_ISR_CTR_INITER_T0)); \
        asm("movwf _isr_ctr_t0"); \
    asm(""lbl_name":");


// >= 5 tacts: 5 or 5+(3 or 8 or 10) == 5 or 8 or 13 or 15 tacts :: debug
// >= 5 tacts: 5 or 5+(3 or 5) == 5 or 8 or 10 tacts             :: non-debug
#define PROJ_CATCH_AVOID_ISR(lbl_name_exit, n_timer_periods) \
    asm("movlw " AUX_STRINGIFY(256-n_timer_periods)); \
    /* asm("bcf	3,5"); select bank 0 (for tmr0 reg) */ \
    asm("subwf 1,w"); \
    asm("skipc"); /* c == no borrow -> timer is lower than constant specified */ \
    asm("goto "lbl_name_exit); \
    asm("clrf 1"); /* TMR0 = 0; avoid ISR */ \
    PROJ_INLINED_ISR_REPLACEMENT(lbl_name_exit)



// sets up adc on PROJ_ADC_CH_VOL; relies on bank 0 being selected
#define PROJ_ADC_SETUP__WHEN_BANK0() \
    asm("movlw " AUX_STRINGIFY((1 | (PROJ_ADC_CH_VOL << 2)))); \
    asm("movwf 31"); // ADCON0 = w

// triggers ADC start; relies on bank 0 being selected
#define PROJ_ADC_START() \
    asm("bsf 31,1"); // ADCON0bits.GO_DONE = 1;

// awaits ADC completion, result is in ADRESH (30); relies on bank 0 being selected
#define PROJ_ADC_WAIT(lbl_name) \
    asm(""lbl_name":"); \
    asm("btfsc 31,1"); /* while(ADCON0bits.GO_DONE) */ \
    asm("goto "lbl_name);

// erases tmp_ctr and tmp_ctr2 vars
void fast_RunADC_8_rising() {
    asm("movlw 5");
    asm("movwf _tmp_ctr"); // tmp_ctr = 5
    asm("clrf _tmp_ctr2"); // last result
    asm("labe_fast_RunADC_8_rising__rising_cycle:");
    PROJ_ADC_START()
    PROJ_ADC_WAIT("labe_fast_RunADC_8_rising__wait")
    // got result in '30' (ADRESH)
    asm("movf 30,w");
    asm("addlw 254"); // w = adc - 2
    asm("subwf _tmp_ctr2,w"); // w = prev_adc - (adc - 2) ;; trigger borrow flag
    asm("skipnc"); // skip next if (borrow -> still rising)
    asm("return");
    // still rising
    asm("decfsz _tmp_ctr");
    asm("goto labe_fast_RunADC_8_rising__continue");
    asm("return");

    asm("labe_fast_RunADC_8_rising__continue:");
    asm("movf 30,w"); // refresh last result (tmp_ctr2)
    asm("movwf _tmp_ctr2");
    asm("goto labe_fast_RunADC_8_rising__rising_cycle");
}

uint8_t fast_mul_8x8_res_h;
uint8_t fast_mul_8x8_res_l;
// multiplies w * PROJ_CONST_THR -> fast_mul_8x8_res_h:fast_mul_8x8_res_l
//// TODO consider tabled search (with tilted curve at very low power percentage? this requires accurate voltage divider)
//// optimum voltage seems to be around ~80% even below 1% of nominal power range of a panel: TODO verify again
void fast_mul_8x8() {
    asm("clrf _fast_mul_8x8_res_h");
    asm("clrf _fast_mul_8x8_res_l");

    #if (PROJ_CONST_THR & 0x80)
        asm("addwf _fast_mul_8x8_res_l,f");
        //asm("skipnc"); // redundant for the first multiplied bit
        //asm("incf _fast_mul_8x8_res_h"); // redundant for the first multiplied bit

        //asm("clrc"); // post 7, pre 6 // redundant for the first multiplied bit
        asm("rlf _fast_mul_8x8_res_l,f");
        asm("rlf _fast_mul_8x8_res_h,f");
    #endif
    #if (PROJ_CONST_THR & 0x40)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
            asm("clrc"); // post 6, pre 5 // only needed if changed after last RRF command
    #endif
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    #if (PROJ_CONST_THR & 0x20)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
            asm("clrc"); // post 5, pre 4 // only needed if changed after last RRF command
    #endif
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    #if (PROJ_CONST_THR & 0x10)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
            asm("clrc"); // post 4, pre 3 // only needed if changed after last RRF command
    #endif
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    #if (PROJ_CONST_THR & 0x08)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
            asm("clrc"); // post 2, pre 2 // only needed if changed after last RRF command
    #endif
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    #if (PROJ_CONST_THR & 0x04)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
            asm("clrc"); // post 2, pre 1 // only needed if changed after last RRF command
    #endif
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    #if (PROJ_CONST_THR & 0x02)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
            asm("clrc"); // post 1, pre 0 // only needed if changed after last RRF command
    #endif
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    #if (PROJ_CONST_THR & 0x01)
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    #endif
        // asm("return"); // auto generated
}

uint8_t last_raw_adc_val = 0;
uint8_t pending_raw_adc_val;
uint8_t thr_min;
uint8_t thr_hi; // high level voltage threshold
uint8_t thr_lo; // low/instant-off voltage threshold
uint8_t pwr_level = 1; // active power level. 0,1 = disconnected; max,max+1 = straight open;
uint8_t tmp_ctr; // temporary
uint8_t tmp_ctr2; // temporary

asm("global _aux_delay_generic");
void aux_delay_generic() {
    // 2(call) + ... + 2(return)
    asm("labe_aux_delay_20:"); asm("fcall labe_aux_delay_4");
    asm("labe_aux_delay_16:"); asm("fcall labe_aux_delay_4");
    asm("labe_aux_delay_12:"); asm("fcall labe_aux_delay_4");
    asm("labe_aux_delay_8:");  asm("fcall labe_aux_delay_4");
    asm("return");
    asm("labe_aux_delay_7:"); asm("nop");
    asm("labe_aux_delay_6:"); asm("nop");
    asm("labe_aux_delay_5:"); asm("nop");
    asm("labe_aux_delay_4:");
    // 'return' is auto-generated
}
#define AUX_DELAY_1 asm("nop");
#define AUX_DELAY_2 asm("nop2"); // compiler knows what to do with nop2; apparently a jump to next command
#define AUX_DELAY_3 asm("nop2"); asm("nop");

#define AUX_DELAY_4 asm("fcall labe_aux_delay_4");
#define AUX_DELAY_5 asm("fcall labe_aux_delay_5");
#define AUX_DELAY_6 asm("fcall labe_aux_delay_6");
#define AUX_DELAY_7 asm("fcall labe_aux_delay_7");
#define AUX_DELAY_8 asm("fcall labe_aux_delay_8");
#define AUX_DELAY_9      asm("fcall labe_aux_delay_4"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_10     asm("fcall labe_aux_delay_4"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_11     asm("fcall labe_aux_delay_4"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_12 asm("fcall labe_aux_delay_12");
#define AUX_DELAY_13     asm("fcall labe_aux_delay_8"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_14     asm("fcall labe_aux_delay_8"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_15     asm("fcall labe_aux_delay_8"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_16 asm("fcall labe_aux_delay_16");
#define AUX_DELAY_17     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_18     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_19     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_20     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_8");
#define AUX_DELAY_21     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_22     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_23     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_24     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_8");
#define AUX_DELAY_25     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_26     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_27     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_28     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_8");

#define AUX_DELAY_32     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_16");
#define AUX_DELAY_36     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_16");
#define AUX_DELAY_40     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_20");



#define PROJ_TEST_LIMIT_RETURN_2_TACTS \
    asm("btfss 5," AUX_STRINGIFY(PROJ_BIT_NUM_IN_INV_LIMIT)); \
    asm("return");

void apply_pwr_level() __at(0x0040)
{
    // asm("bcf 3,5"); // ensure bank0 selected
    asm("movf _pwr_level,w");
    asm("addwf 2,f"); // PCL += pwr_level: tabled jump

    // TODO OPT MIGHT take advantage of jump to offset*2 to avoid intermediate jumps in some cases

