Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    asm("goto labe_apply_pwr_level__pre_zero"); // 0 *
    asm("goto labe_apply_pwr_level__zero"); // 1
    asm("goto labe_apply_pwr_level__d2_c1"); // 2
    asm("goto labe_apply_pwr_level__d2_c2_long"); // 3
    asm("goto labe_apply_pwr_level__d2_c2_short"); // 4
    asm("goto labe_apply_pwr_level__d3_c1"); // 5
    asm("goto labe_apply_pwr_level__d2c1__d3c1"); // 6
    asm("goto labe_apply_pwr_level__d3c1__d3c1"); // 7
    asm("goto labe_apply_pwr_level__d3_c2"); // 8
    asm("goto labe_apply_pwr_level__d3_c3"); // 9
    asm("goto labe_apply_pwr_level__d3_c4"); // 10
    asm("goto labe_apply_pwr_level__d3_c5"); // 11
    asm("goto labe_apply_pwr_level__d3_c7"); // 12
    asm("goto labe_apply_pwr_level__d3_c9"); // 13
    asm("goto labe_apply_pwr_level__d3_c12"); // 14
    asm("goto labe_apply_pwr_level__d3_c15"); // 15
    asm("goto labe_apply_pwr_level__d3_c19"); // 16
    asm("goto labe_apply_pwr_level__d3_c24"); // 17
    asm("goto labe_apply_pwr_level__d4_c18"); // 18
    asm("goto labe_apply_pwr_level__d5_c15"); // 19
    asm("goto labe_apply_pwr_level__d6_c12"); // 20
    asm("goto labe_apply_pwr_level__d7_c10"); // 21
    asm("goto labe_apply_pwr_level__d9_c8"); // 22
    asm("goto labe_apply_pwr_level__d12_c6"); // 23
    asm("goto labe_apply_pwr_level__d15_c5"); // 24
    asm("goto labe_apply_pwr_level__d18_c4"); // 25
    asm("goto labe_apply_pwr_level__d21_c3"); // 26
    asm("goto labe_apply_pwr_level__max"); // 27
    asm("goto labe_apply_pwr_level__post_max"); // 28 max+1 *
    // end table
    // ----- 0
    asm("labe_apply_pwr_level__pre_zero:");
    asm("incf _pwr_level,f"); // edge handling
    asm("labe_apply_pwr_level__zero:");
        PROJ_SET_GPIO_CAPON_PWMOFF
        asm("return");

    // TODO handle PROJ_BIT_NUM_IN_INV_LIMIT as much as possible

    // ----- duration 2
    asm("labe_apply_pwr_level__d2_c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    asm("labe_apply_pwr_level__d2_c2_long:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_8
        PROJ_TEST_LIMIT_RETURN_2_TACTS
        // TODO SIZE: can reduce delay and just jump to labe_apply_pwr_level__d2_c1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    asm("labe_apply_pwr_level__d2_c2_short:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_2
        PROJ_TEST_LIMIT_RETURN_2_TACTS
        // TODO SIZE: can reduce delay and just jump to labe_apply_pwr_level__d2_c1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    // ----- duration 3
    asm("labe_apply_pwr_level__d3_c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    // ----- duration 2+3
    asm("labe_apply_pwr_level__d2c1__d3c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_5 // distribute load more evenly
        PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        AUX_DELAY_1
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    // ----- duration 3+3
    asm("labe_apply_pwr_level__d3c1__d3c1:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_5 // distribute load more evenly
        PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        AUX_DELAY_1
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    asm("labe_apply_pwr_level__d3_c2:");
        asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("return");

    asm("labe_apply_pwr_level__d3_c3:");
    asm("movlw 1");
    asm("goto labe_apply_pwr_level__d3_X2cycleP1_preinit");

    asm("labe_apply_pwr_level__d3_c4:");
    asm("movlw 2");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    asm("goto labe_apply_pwr_level__d3_X2cycle_mid");

    asm("labe_apply_pwr_level__d3_c5:");
    asm("movlw 2");
    asm("goto labe_apply_pwr_level__d3_X2cycleP1_preinit");

    asm("labe_apply_pwr_level__d3_c7:");
    asm("movlw 3");
    asm("goto labe_apply_pwr_level__d3_X2cycleP1_preinit");

    asm("labe_apply_pwr_level__d3_c9:");
    asm("movlw 4");
    asm("goto labe_apply_pwr_level__d3_X2cycleP1_preinit");

    asm("labe_apply_pwr_level__d3_c12:");
    asm("movlw 6");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    asm("goto labe_apply_pwr_level__d3_X2cycle_mid");

    asm("labe_apply_pwr_level__d3_c15:");
    asm("movlw 7");
    asm("goto labe_apply_pwr_level__d3_X2cycleP1_preinit");

    asm("labe_apply_pwr_level__d3_c19:");
    asm("movlw 9");
    asm("goto labe_apply_pwr_level__d3_X2cycleP1_preinit");

    asm("labe_apply_pwr_level__d3_c24:");
    asm("movlw 12");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    asm("goto labe_apply_pwr_level__d3_X2cycle_mid");

    // ----- generic 3
    asm("labe_apply_pwr_level__d3_X2cycleP1_preinit:");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    asm("labe_apply_pwr_level__d3_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("labe_apply_pwr_level__d3_X2cycle_mid:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_1
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d3_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_1
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d4_c18:");
    asm("movlw 8");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 4
    asm("labe_apply_pwr_level__d4_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_2
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_2
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d4_cycle");
            // last iterations - after cycle, to minimize further delay
            PROJ_TEST_LIMIT_RETURN_2_TACTS
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_2
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
                AUX_DELAY_2
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_2
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__d5_c15:");
    asm("movlw 7");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w"); // relying on getting here only when current PWM state=0
    // ----- generic 5
    asm("labe_apply_pwr_level__d5_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_3
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_1
            PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_3
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d5_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_3
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

