Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    // special handler
    asm("labe_apply_pwr_level__special:");
    asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
    asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_17
    asm("goto labe_apply_pwr_level__pre_max_level");
    //

    asm("labe_apply_pwr_level__d21_c3:");
    asm("movlw 2");
    asm("movwf _tmp_ctr");
    asm("movf _gp_shadow,w");
    //
    asm("btfsc 5," AUX_STRINGIFY(PROJ_BIT_NUM_OUT_PWM_0)); // check if we came here from pwr MAX - then pre-apply 0
    asm("goto labe_apply_pwr_level__special");
    //
    // ----- generic 21
    asm("labe_apply_pwr_level__pre_max_level:");
    asm("labe_apply_pwr_level__d21_cycle:");
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
            AUX_DELAY_19
        asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
            AUX_DELAY_14
            PROJ_TEST_LIMIT_RETURN_2_TACTS
        asm("decfsz _tmp_ctr,f");
        asm("goto labe_apply_pwr_level__d21_cycle");
            // last iteration - after cycle, to minimize further delay
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 1 */
                AUX_DELAY_19
            // TODO SIZE: can reduce delay and just jump to such common quit
            asm("xorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_ALL_MASK));
            asm("movwf 5"); /* assign GPIO: output = 0 */
            asm("return");

    asm("labe_apply_pwr_level__post_max:");
    asm("decf _pwr_level,f"); // edge handling
    asm("labe_apply_pwr_level__max:");
        PROJ_SET_GPIO_CAPON_PWMON
        asm("return");
}

void main() {
    TRISIO = ((1 << PROJ_BIT_NUM_OUT_PWM_0)
            | (1 << PROJ_BIT_NUM_OUT_PWM_1)
            | (1 << PROJ_BIT_NUM_OUT_CAP)
#ifdef PROJ_BIT_NUM_OUT_INV_PWM
            | (1 << PROJ_BIT_NUM_OUT_INV_PWM)
#endif
            ) ^ 0x3F
            ;
    ANSEL = (PROJ_ADC_ADCS << 4) | (1 << PROJ_ADC_CH_VOL); // set conversion time and ADC channel

    asm("bcf 3,5"); // ensure bank0 selected
    asm("movlw " AUX_STRINGIFY(PROJ_STATE_GPIO_CAPON_PWMOFF));
    asm("movwf 5"); // initial assignment
    asm("movwf _gp_shadow");

    CMCON = 0x07;
    WPU = 0xFF; // all possible pullups
    OSCCAL = __osccal_val();

    dirty_flags = 0;
    app_rise_counter = PROJ_PWR_RISE_DELAY;

    OPTION_REG = (PROJ_TMR_PRESCALE); // (!nGPPU - enable pullups), prescaler setup
    TMR0 = 0;
    INTCON = 0xA0; // GIE + T0IE: enable interrupts and T0 timer

    asm("bcf 3,5"); // ensure bank0 selected
    PROJ_ADC_SETUP__WHEN_BANK0()
    AUX_DELAY_40
    PROJ_ADC_START()
    PROJ_ADC_WAIT("labe_preinit_adc_min_voltage")
    asm("movf 30,w"); // w = ADRESH
    asm("movwf _thr_min"); // thr_min = w (ADC result)

    // TODO revise thr_min? in case of having very high startup current (connecting to high-saturated solar; which would drive thr_min too high)
    // this is probably not necessary with 'PWRTE = OFF' as startup time is very small. TODO calculate/verify
    if((thr_min + (3 + PROJ_THR_DIFF_INSTANT_DROPOUT)) > thr_min) { // +1% +dropout. ensure no overflow
        // must be no overflow - otherwise it's mistake in scheme or ADC failure
        thr_min += (3 + PROJ_THR_DIFF_INSTANT_DROPOUT);
    }

    // pre-init raw adc with pre-wait 1 second
    asm("bcf 3,5"); // ensure bank0 selected
    asm("labe_main__preinit_raw_adc:");
    asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_TRAW));
    asm("goto labe_main__preinit_raw_adc");
    asm("clrf _dirty_flags");
    {
        PROJ_SET_GPIO_CAPON_PWMOFF
        PROJ_SET_GPIO_CAPOFF_PWMOFF

        asm("fcall _fast_RunADC_8_rising");
        asm("movf 30,w"); // w = ADRESH (ADC result)
        asm("movwf _last_raw_adc_val");

        asm("bsf _gp_shadow," AUX_STRINGIFY(PROJ_BIT_NUM_OUT_CAP));
        asm("movf _gp_shadow,w");
        asm("movwf 5"); // attach capacitor
    }
    {
        //asm("bcf 3,5"); // ensure bank0 selected
        asm("movf _last_raw_adc_val,w");
        asm("fcall _fast_mul_8x8");

        asm("movf _fast_mul_8x8_res_h,w");
        asm("movwf _thr_hi"); // thr_hi = last_raw_adc_val * g_thr / 256
        //
        asm("subwf _thr_min,w"); // w(thr_hi) = thr_min - w ; if borrow - no action
        asm("skipnc"); // skip next if borrow
        asm("addwf _thr_hi,f"); // thr_hi += (thr_min - thr_hi)
        //
        asm("movlw " AUX_STRINGIFY(PROJ_THR_DIFF_INSTANT_DROPOUT));
        asm("subwf _thr_hi,w"); // w = thr_hi - PROJ_THR_DIFF_INSTANT_DROPOUT
        asm("movwf _thr_lo");
    }
    //

    asm("labe_main__cycle:");
        // asm("bcf 3,5"); // ensure bank0 selected
        PROJ_ADC_START()
        PROJ_CATCH_AVOID_ISR("labe_main__intercept_isr", 2) // 2 => at least 512 tacts until isr
        // check for limit
        asm("btfsc 5," AUX_STRINGIFY(PROJ_BIT_NUM_IN_INV_LIMIT));
        asm("goto labe_main__cycle_await_adc");
        // limit reached - handle it
        PROJ_ADC_WAIT("labe_main__cycle_dummy_await_adc") // adc awaiting to ensure correct functioning. TODO can be optimized out depending on timings
        asm("movlw " AUX_STRINGIFY(PROJ_PWR_LEVEL_CUT)); // w == cut_level
        asm("subwf _pwr_level,w"); // w(cut_level) = pwr_level - w
        asm("skipc"); // c == no borrow
        asm("goto labe_main__cycle_pre_check_flags"); // pwr_level < cut_level : just pass to flags processing
            // pwr_level >= cut_level
            PROJ_SET_GPIO_CAPON_PWMOFF // ensure output is switched to 0 in case we came here from max pwr level
            asm("movlw " AUX_STRINGIFY(PROJ_PWR_LEVEL_CUT)); // w == cut_level
            asm("movwf _pwr_level"); // cut
            asm("goto labe_main__cycle_pre_check_flags");

        // main part:
            PROJ_ADC_WAIT("labe_main__cycle_await_adc") // TODO if ADC time selection changes to 4us - explicit awaiting can be omitted in this place
#define VAR_ADCVAL "30" // avoid copying ADC result to minimize executed code
//            asm("movf 30,w"); // w = ADRESH
//            asm("movwf _tmp_ctr"); // tmp_ctr = w (ADC result)
//#define VAR_ADCVAL "_tmp_ctr"
            // relying on bank0 selected here
            asm("movf _thr_hi,w"); // w = thr_hi
            asm("subwf " VAR_ADCVAL ",w"); // w = adcval - thr_hi
            asm("skipnc"); // nc == borrow
            asm("goto labe_main__ge_thr_hi"); // jump if adcval >= thr_hi
                // else : adcval < thr_hi
                asm("movlw " AUX_STRINGIFY(1)); // w = 1
                asm("movwf _app_rise_counter"); // app_rise_counter = 1 (allow fastest rise)

                asm("movf " VAR_ADCVAL ",w"); // w = adcval
                asm("subwf _thr_lo,w"); // w = thr_lo - adcval
                asm("skipnc"); // nc == borrow
                asm("goto labe_main__le_thr_lo"); // jump if thr_lo >= adcval
                    // else : adcval > thr_lo ; adcval < thr_hi
                    asm("decf _pwr_level,f"); // decrement (edge handling is done inside apply_pwr func)
                    asm("goto labe_main__pre_apply_pwr");
                asm("labe_main__le_thr_lo:");
                // thr_lo >= adcval
                asm("clrf _pwr_level");
                asm("goto labe_main__pre_apply_pwr");
                ////
                asm("labe_main__eq_thr_hi:"); // adcval == thr_hi
                asm("movf _pwr_level,f"); // test curr power
                asm("skipnz");
                asm("goto labe_main__maybe_rise"); // allow such rising from pwr0 to pwr1 only, otherwise - reset counter, consider a 'stable state'
                asm("movlw " AUX_STRINGIFY(1)); // w = 1
                asm("movwf _app_rise_counter"); // app_rise_counter = 1 (allow fastest rise)
                asm("goto labe_main__pre_apply_pwr");
                ////
            asm("labe_main__ge_thr_hi:");
            // adcval >= thr_hi
            asm("skipnz");
            asm("goto labe_main__eq_thr_hi"); // jump if adcval == thr_hi
            // adcval > thr_hi
            asm("labe_main__maybe_rise:");
            asm("decfsz _app_rise_counter");
            asm("goto labe_main__pre_apply_pwr"); // rising not allowed yet, jump to apply pwr
                // else - rising allowed, reset the counter and rise
                asm("movlw " AUX_STRINGIFY(PROJ_PWR_RISE_DELAY)); // w = PROJ_PWR_RISE_DELAY
                asm("movwf _app_rise_counter"); // app_rise_counter = PROJ_PWR_RISE_DELAY
            asm("incf _pwr_level,f"); // increment (edge handling is done inside apply_pwr func)
            // redundant cmd: asm("goto labe_main__pre_apply_pwr");
            asm("labe_main__pre_apply_pwr:");
            asm("fcall _apply_pwr_level");
        // main part done


        asm("labe_main__cycle_pre_check_flags:");
        // asm("bcf 3,5"); // ensure bank0 selected
        asm("movf _dirty_flags,f"); // test
        asm("skipnz");
        asm("goto labe_main__cycle");
            // something is dirty
            //asm("bcf 3,5"); // ensure bank0 selected
            asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_TRAW));
            asm("goto labe_main__traw_non_dirty");
                // detach load, then detach cap
                PROJ_SET_GPIO_CAPON_PWMOFF // TODO can be done slightly faster here (no refreshing gp_shadow needed until the end of block (or ever?))
                PROJ_SET_GPIO_CAPOFF_PWMOFF
                // detached cap, give some time to establish raw voltage
                // now flags
                asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_TRAW));
                asm("movlw " AUX_STRINGIFY(PROJ_PWR_RISE_DELAY)); // w = PROJ_PWR_RISE_DELAY
                asm("movwf _app_rise_counter"); // app_rise_counter = PROJ_PWR_RISE_DELAY
                // .. gonna put some dirt in your flags
                asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_THRS));
                asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP1));
                asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP2));

                // and run adc and bring cap back
                asm("fcall _fast_RunADC_8_rising");
                // attach cap first
                PROJ_SET_GPIO_CAPON_PWMOFF // attach capacitor back
                // now save result
                asm("movf 30,w"); // w = ADRESH (ADC result)
                asm("movwf _pending_raw_adc_val");
                asm("goto labe_main__cycle"); // enough delaying work - to cycle start
            asm("labe_main__traw_non_dirty:");


            // cascade nops - used together (nop2 is nested in nop1 to minimize cycle path delay)
            asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP1));
            asm("goto labe_main__nop1_non_dirty");
                asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP2));
                asm("goto labe_main__nop2_non_dirty");
                    asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP2));
                    asm("goto labe_main__cycle");
                asm("labe_main__nop2_non_dirty:");
                //
                asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP1));
                asm("goto labe_main__cycle");
            asm("labe_main__nop1_non_dirty:");

            // last flag checked - checking is redundant in this case
            //asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_THRS));
            //asm("goto labe_main__cycle"); // asm("goto labe_main__thr_non_dirty");
                asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_THRS));
                //
                asm("movf _pending_raw_adc_val,w"); // TODO input1 can be union with last_raw_adc_val to save 2 commands
                asm("xorwf _last_raw_adc_val,w");
                asm("skipnz");
                asm("goto labe_main__cycle"); // no changes - to cycle start
                // different - needs recalculation
                //
                asm("movlw " AUX_STRINGIFY(PROJ_PWR_RISE_DELAY)); // w = PROJ_PWR_RISE_DELAY
                asm("movwf _app_rise_counter"); // app_rise_counter = PROJ_PWR_RISE_DELAY

                asm("movf _pending_raw_adc_val,w");
                asm("movwf _last_raw_adc_val");
                asm("fcall _fast_mul_8x8");

                asm("movf _fast_mul_8x8_res_h,w");
                asm("movwf _thr_hi"); // thr_hi = last_raw_adc_val * g_thr / 256
                //
                asm("subwf _thr_min,w"); // w(thr_hi) = thr_min - w ; if borrow - no action
                asm("skipnc"); // skip next if borrow
                asm("addwf _thr_hi,f"); // thr_hi += (thr_min - thr_hi)
                //
                asm("movlw " AUX_STRINGIFY(PROJ_THR_DIFF_INSTANT_DROPOUT));
                asm("subwf _thr_hi,w"); // w = thr_hi - PROJ_THR_DIFF_INSTANT_DROPOUT
                asm("movwf _thr_lo");
                asm("goto labe_main__cycle"); // enough delaying work - to cycle start
            //asm("labe_main__thr_non_dirty:");
        asm("goto labe_main__cycle");
} //



asm("global _aux_version_info_footer");
void aux_version_info_footer(void) __at(0x03FF - 5) {
    asm("retlw " AUX_STRINGIFY(FW_VER_MAJOR));
    asm("retlw " AUX_STRINGIFY(FW_VER_MINOR));
    asm("retlw " AUX_STRINGIFY(FW_VER_THR));
    asm("retlw " AUX_STRINGIFY(FW_VER_OPTION));
    // 'return' is auto-generated here so 1 last byte is skipped to ensure it won't erase OSCCAL
}
